JonathanMichaelEdwards/STM32MP157C_SBC/src/Cortex-M4/src/startup_stm32mp157c.s
/**
  ******************************************************************************
  * @file      startup_stm32mp15xx.s
  * @author    MCD Application Team
  * @brief     STM32MP15xx Devices vector table for GCC based toolchain.
  *            This module performs:
  *                - Set the initial SP
  *                - Set the initial PC == Reset_Handler,
  *                - Set the vector table entries with the exceptions ISR address
  *                - Branches to main in the C library (which eventually
  *                  calls main()).
  *            After Reset the Cortex-M processor is in Thread mode,
  *            priority is Privileged, and the Stack is set to Main.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

  .syntax unified
  .cpu cortex-m4
  .fpu softvfp
  .thumb

.global g_pfnVectors
.global Default_Handler

/* start address for the initialization values of the .data section.
defined in linker script */
.word _sidata
/* start address for the .data section. defined in linker script */
.word _sdata
/* end address for the .data section. defined in linker script */
.word _edata
/* start address for the .bss section. defined in linker script */
.word _sbss
/* end address for the .bss section. defined in linker script */
.word _ebss

  .section .startup_copro_fw.Reset_Handler,"ax"
  .weak Reset_Handler
  .type Reset_Handler, %function
Reset_Handler:
  ldr   sp, =_estack      /* set stack pointer */

/*     
 * Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      _sidata: End of code section, i.e., begin of data sections to copy from.
 *      _sdata/_edata: RAM address range that data should be
 *      copied to. Both must be aligned to 4 bytes boundary.  
 */
  movs  r1, #0
  b  LoopCopyDataInit

CopyDataInit:
  ldr  r3, =_sidata
  ldr  r3, [r3, r1]
  str  r3, [r0, r1]
  adds  r1, r1, #4

LoopCopyDataInit:
  ldr  r0, =_sdata
  ldr  r3, =_edata
  adds  r2, r0, r1
  cmp  r2, r3
  bcc  CopyDataInit
  ldr  r2, =_sbss
  b  LoopFillZerobss

/* 
 * Zero fill the bss segment.
 */
FillZerobss:
  movs  r3, #0
  str  r3, [r2], #4

LoopFillZerobss:
  ldr  r3, = _ebss
  cmp  r2, r3
  bcc  FillZerobss


// Call the clock system intitialization function
  bl  SystemInit
 // ldr r0, =SystemInit
 // blx r0

// Call static constructors
 bl __libc_init_array
 // ldr r0, =__libc_init_array
 // blx r0
// Call the application's entry point.*/
  bl main
  //ldr r0, =main
  //blx r0

LoopForever:
    b LoopForever


.size Reset_Handler, .-Reset_Handler

/*******************************************************************************
 * @brief  This is the code that gets called when the processor receives an
 *         unexpected interrupt.  This simply enters an infinite loop, preserving
 *         the system state for examination by a debugger.
 *
 * @param  None
 * @retval : None
 *******************************************************************************/
    .section .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
  b Infinite_Loop
  .size Default_Handler, .-Default_Handler
/******************************************************************************
 * The minimal vector table for a Cortex M4.  Note that the proper constructs
 * must be placed on this to ensure that it ends up at physical address
 * 0x0000.0000.
 ******************************************************************************/
   .section .isr_vector,"a",%progbits
  .type g_pfnVectors, %object
  .size g_pfnVectors, .-g_pfnVectors


g_pfnVectors:
    .word  _estack                           // Top of Stack
    .word  Reset_Handler                     // Reset Handler
    .word  NMI_Handler                       // NMI Handler
    .word  HardFault_Handler                 // Hard Fault Handler
    .word  MemManage_Handler                 // MPU Fault Handler
    .word  BusFault_Handler                  // Bus Fault Handler
    .word  UsageFault_Handler                // Usage Fault Handler
    .word  0                                 // Reserved
    .word  0                                 // Reserved
    .word  0                                 // Reserved
    .word  0                                 // Reserved
    .word  SVC_Handler                       // SVCall Handler
    .word  DebugMon_Handler                  // Debug Monitor Handler
    .word  0                                 // Reserved
    .word  PendSV_Handler                    // PendSV Handler
    .word  SysTick_Handler                   // SysTick Handler

    // External Interrupts
    .word  WWDG1_IRQHandler                  // Window WatchDog 1
    .word  PVD_AVD_IRQHandler                // PVD and AVD through EXTI Line detection
    .word  TAMP_IRQHandler                   // Tamper and TimeStamps through the EXTI line
    .word  RTC_WKUP_ALARM_IRQHandler         // RTC Wakeup and Alarm through the EXTI line
    .word  RESERVED4_IRQHandler              // Reserved
    .word  RCC_IRQHandler                    // RCC
    .word  EXTI0_IRQHandler                  // EXTI Line0
    .word  EXTI1_IRQHandler                  // EXTI Line1
    .word  EXTI2_IRQHandler                  // EXTI Line2
    .word  EXTI3_IRQHandler                  // EXTI Line3
    .word  EXTI4_IRQHandler                  // EXTI Line4
    .word  DMA1_Stream0_IRQHandler           // DMA1 Stream 0
    .word  DMA1_Stream1_IRQHandler           // DMA1 Stream 1
    .word  DMA1_Stream2_IRQHandler           // DMA1 Stream 2
    .word  DMA1_Stream3_IRQHandler           // DMA1 Stream 3
    .word  DMA1_Stream4_IRQHandler           // DMA1 Stream 4
    .word  DMA1_Stream5_IRQHandler           // DMA1 Stream 5
    .word  DMA1_Stream6_IRQHandler           // DMA1 Stream 6
    .word  ADC1_IRQHandler                   // ADC1
    .word  FDCAN1_IT0_IRQHandler             // FDCAN1 Interrupt line 0
    .word  FDCAN2_IT0_IRQHandler             // FDCAN2 Interrupt line 0
    .word  FDCAN1_IT1_IRQHandler             // FDCAN1 Interrupt line 1
    .word  FDCAN2_IT1_IRQHandler             // FDCAN2 Interrupt line 1
    .word  EXTI5_IRQHandler                  // External Line5 interrupts through AIEC
    .word  TIM1_BRK_IRQHandler               // TIM1 Break interrupt
    .word  TIM1_UP_IRQHandler                // TIM1 Update Interrupt
    .word  TIM1_TRG_COM_IRQHandler           // TIM1 Trigger and Commutation Interrupt
    .word  TIM1_CC_IRQHandler                // TIM1 Capture Compare
    .word  TIM2_IRQHandler                   // TIM2
    .word  TIM3_IRQHandler                   // TIM3
    .word  TIM4_IRQHandler                   // TIM4
    .word  I2C1_EV_IRQHandler                // I2C1 Event
    .word  I2C1_ER_IRQHandler                // I2C1 Error
    .word  I2C2_EV_IRQHandler                // I2C2 Event
    .word  I2C2_ER_IRQHandler                // I2C2 Error
    .word  SPI1_IRQHandler                   // SPI1
    .word  SPI2_IRQHandler                   // SPI2
    .word  USART1_IRQHandler                 // USART1
    .word  USART2_IRQHandler                 // USART2
    .word  USART3_IRQHandler                 // USART3
    .word  EXTI10_IRQHandler                 // External Line10 interrupts through AIEC
    .word  RTC_TIMESTAMP_IRQHandler          // RTC TimeStamp through EXTI Line
    .word  EXTI11_IRQHandler                 // External Line11 interrupts through AIEC
    .word  TIM8_BRK_IRQHandler               // TIM8 Break Interrupt
    .word  TIM8_UP_IRQHandler                // TIM8 Update Interrupt
    .word  TIM8_TRG_COM_IRQHandler           // TIM8 Trigger and Commutation Interrupt
    .word  TIM8_CC_IRQHandler                // TIM8 Capture Compare Interrupt
    .word  DMA1_Stream7_IRQHandler           // DMA1 Stream7
    .word  FMC_IRQHandler                    // FMC
    .word  SDMMC1_IRQHandler                 // SDMMC1
    .word  TIM5_IRQHandler                   // TIM5
    .word  SPI3_IRQHandler                   // SPI3
    .word  UART4_IRQHandler                  // UART4
    .word  UART5_IRQHandler                  // UART5
    .word  TIM6_IRQHandler                   // TIM6
    .word  TIM7_IRQHandler                   // TIM7
    .word  DMA2_Stream0_IRQHandler           // DMA2 Stream 0
    .word  DMA2_Stream1_IRQHandler           // DMA2 Stream 1
    .word  DMA2_Stream2_IRQHandler           // DMA2 Stream 2
    .word  DMA2_Stream3_IRQHandler           // DMA2 Stream 3
    .word  DMA2_Stream4_IRQHandler           // DMA2 Stream 4
    .word  ETH1_IRQHandler                   // Ethernet
    .word  ETH1_WKUP_IRQHandler              // Ethernet Wakeup through EXTI line
    .word  FDCAN_CAL_IRQHandler              // FDCAN Calibration
    .word  EXTI6_IRQHandler                  // EXTI Line6 interrupts through AIEC
    .word  EXTI7_IRQHandler                  // EXTI Line7 interrupts through AIEC
    .word  EXTI8_IRQHandler                  // EXTI Line8 interrupts through AIEC
    .word  EXTI9_IRQHandler                  // EXTI Line9 interrupts through AIEC
    .word  DMA2_Stream5_IRQHandler           // DMA2 Stream 5
    .word  DMA2_Stream6_IRQHandler           // DMA2 Stream 6
    .word  DMA2_Stream7_IRQHandler           // DMA2 Stream 7
    .word  USART6_IRQHandler                 // USART6
    .word  I2C3_EV_IRQHandler                // I2C3 event
    .word  I2C3_ER_IRQHandler                // I2C3 error
    .word  USBH_OHCI_IRQHandler              // USB Host OHCI
    .word  USBH_EHCI_IRQHandler              // USB Host EHCI
    .word  EXTI12_IRQHandler                 // EXTI Line12 interrupts through AIEC
    .word  EXTI13_IRQHandler                 // EXTI Line13 interrupts through AIEC
    .word  DCMI_IRQHandler                   // DCMI
    .word  CRYP1_IRQHandler                  // Crypto1 global interrupt
    .word  HASH1_IRQHandler                  // Crypto Hash1 interrupt
    .word  FPU_IRQHandler                    // FPU
    .word  UART7_IRQHandler                  // UART7
    .word  UART8_IRQHandler                  // UART8
    .word  SPI4_IRQHandler                   // SPI4
    .word  SPI5_IRQHandler                   // SPI5
    .word  SPI6_IRQHandler                   // SPI6
    .word  SAI1_IRQHandler                   // SAI1
    .word  LTDC_IRQHandler                   // LTDC
    .word  LTDC_ER_IRQHandler                // LTDC error
    .word  ADC2_IRQHandler                   // ADC2
    .word  SAI2_IRQHandler                   // SAI2
    .word  QUADSPI_IRQHandler                // QUADSPI
    .word  LPTIM1_IRQHandler                 // LPTIM1 global interrupt
    .word  CEC_IRQHandler                    // HDMI_CEC
    .word  I2C4_EV_IRQHandler                // I2C4 Event
    .word  I2C4_ER_IRQHandler                // I2C4 Error
    .word  SPDIF_RX_IRQHandler               // SPDIF_RX
    .word  OTG_IRQHandler                    // USB On The Go HS global interrupt
    .word  RESERVED99_IRQHandler             // Reserved
    .word  IPCC_RX0_IRQHandler               // Mailbox RX0 Free interrupt
    .word  IPCC_TX0_IRQHandler               // Mailbox TX0 Free interrupt
    .word  DMAMUX1_OVR_IRQHandler            // DMAMUX1 Overrun interrupt
    .word  IPCC_RX1_IRQHandler               // Mailbox RX1 Free interrupt
    .word  IPCC_TX1_IRQHandler               // Mailbox TX1 Free interrupt
    .word  CRYP2_IRQHandler                  // Crypto2 global interrupt
    .word  HASH2_IRQHandler                  // Crypto Hash2 interrupt
    .word  I2C5_EV_IRQHandler                // I2C5 Event Interrupt
    .word  I2C5_ER_IRQHandler                // I2C5 Error Interrupt
    .word  GPU_IRQHandler                    // GPU Global Interrupt
    .word  DFSDM1_FLT0_IRQHandler            // DFSDM Filter0 Interrupt
    .word  DFSDM1_FLT1_IRQHandler            // DFSDM Filter1 Interrupt
    .word  DFSDM1_FLT2_IRQHandler            // DFSDM Filter2 Interrupt
    .word  DFSDM1_FLT3_IRQHandler            // DFSDM Filter3 Interrupt
    .word  SAI3_IRQHandler                   // SAI3 global Interrupt
    .word  DFSDM1_FLT4_IRQHandler            // DFSDM Filter4 Interrupt
    .word  TIM15_IRQHandler                  // TIM15 global Interrupt
    .word  TIM16_IRQHandler                  // TIM16 global Interrupt
    .word  TIM17_IRQHandler                  // TIM17 global Interrupt
    .word  TIM12_IRQHandler                  // TIM12 global Interrupt
    .word  MDIOS_IRQHandler                  // MDIOS global Interrupt
    .word  EXTI14_IRQHandler                 // EXTI Line14 interrupts through AIEC
    .word  MDMA_IRQHandler                   // MDMA global Interrupt
    .word  DSI_IRQHandler                    // DSI global Interrupt
    .word  SDMMC2_IRQHandler                 // SDMMC2 global Interrupt
    .word  HSEM_IT2_IRQHandler               // HSEM global Interrupt
    .word  DFSDM1_FLT5_IRQHandler            // DFSDM Filter5 Interrupt
    .word  EXTI15_IRQHandler                 // EXTI Line15 interrupts through AIEC
    .word  nCTIIRQ1_IRQHandler               // Cortex-M4 CTI interrupt 1
    .word  nCTIIRQ2_IRQHandler               // Cortex-M4 CTI interrupt 2
    .word  TIM13_IRQHandler                  // TIM13 global interrupt
    .word  TIM14_IRQHandler                  // TIM14 global interrupt
    .word  DAC_IRQHandler                    // DAC1 and DAC2 underrun error interrupts
    .word  RNG1_IRQHandler                   // RNG1 interrupt
    .word  RNG2_IRQHandler                   // RNG2 interrupt
    .word  I2C6_EV_IRQHandler                // I2C6 Event Interrupt
    .word  I2C6_ER_IRQHandler                // I2C6 Error Interrupt
    .word  SDMMC3_IRQHandler                 // SDMMC3 global Interrupt
    .word  LPTIM2_IRQHandler                 // LPTIM2 global interrupt
    .word  LPTIM3_IRQHandler                 // LPTIM3 global interrupt
    .word  LPTIM4_IRQHandler                 // LPTIM4 global interrupt
    .word  LPTIM5_IRQHandler                 // LPTIM5 global interrupt
    .word  ETH1_LPI_IRQHandler               // ETH1_LPI interrupt
    .word  RESERVED143_IRQHandler            // Reserved
    .word  MPU_SEV_IRQHandler                // MPU Send Event through AIEC
    .word  RCC_WAKEUP_IRQHandler             // RCC Wake up interrupt
    .word  SAI4_IRQHandler                   // SAI4 global interrupt
    .word  DTS_IRQHandler                    // Temperature sensor interrupt
    .word  RESERVED148_IRQHandler            // Reserved
    .word  WAKEUP_PIN_IRQHandler             // Interrupt for all 6 wake-up pins


