JonathanMichaelEdwards/STM32MP157C_SBC/src/Cortex-M4/src/startup_stm32mp157c.s
    .weak      TIM6_IRQHandler
    .thumb_set TIM6_IRQHandler,Default_Handler

    .weak      TIM7_IRQHandler
    .thumb_set TIM7_IRQHandler,Default_Handler

    .weak      DMA2_Stream0_IRQHandler
    .thumb_set DMA2_Stream0_IRQHandler,Default_Handler

    .weak      DMA2_Stream1_IRQHandler
    .thumb_set DMA2_Stream1_IRQHandler,Default_Handler

    .weak      DMA2_Stream2_IRQHandler
    .thumb_set DMA2_Stream2_IRQHandler,Default_Handler

    .weak      DMA2_Stream3_IRQHandler
    .thumb_set DMA2_Stream3_IRQHandler,Default_Handler

    .weak      DMA2_Stream4_IRQHandler
    .thumb_set DMA2_Stream4_IRQHandler,Default_Handler

    .weak      ETH1_IRQHandler
    .thumb_set ETH1_IRQHandler,Default_Handler

    .weak      ETH1_WKUP_IRQHandler
    .thumb_set ETH1_WKUP_IRQHandler,Default_Handler

    .weak      ETH1_LPI_IRQHandler
    .thumb_set ETH1_LPI_IRQHandler,Default_Handler

    .weak      EXTI6_IRQHandler
    .thumb_set EXTI6_IRQHandler,Default_Handler

    .weak      EXTI7_IRQHandler
    .thumb_set EXTI7_IRQHandler,Default_Handler

    .weak      EXTI8_IRQHandler
    .thumb_set EXTI8_IRQHandler,Default_Handler

    .weak      EXTI9_IRQHandler
    .thumb_set EXTI9_IRQHandler,Default_Handler

    .weak      DMA2_Stream5_IRQHandler
    .thumb_set DMA2_Stream5_IRQHandler,Default_Handler

    .weak      DMA2_Stream6_IRQHandler
    .thumb_set DMA2_Stream6_IRQHandler,Default_Handler

    .weak      DMA2_Stream7_IRQHandler
    .thumb_set DMA2_Stream7_IRQHandler,Default_Handler

    .weak      USART6_IRQHandler
    .thumb_set USART6_IRQHandler,Default_Handler

    .weak      I2C3_EV_IRQHandler
    .thumb_set I2C3_EV_IRQHandler,Default_Handler

    .weak      I2C3_ER_IRQHandler
    .thumb_set I2C3_ER_IRQHandler,Default_Handler

    .weak      USBH_OHCI_IRQHandler
    .thumb_set USBH_OHCI_IRQHandler,Default_Handler

    .weak      USBH_EHCI_IRQHandler
    .thumb_set USBH_EHCI_IRQHandler,Default_Handler

    .weak      EXTI12_IRQHandler
    .thumb_set EXTI12_IRQHandler,Default_Handler

    .weak      EXTI13_IRQHandler
    .thumb_set EXTI13_IRQHandler,Default_Handler

    .weak      DCMI_IRQHandler
    .thumb_set DCMI_IRQHandler,Default_Handler

    .weak      CRYP1_IRQHandler
    .thumb_set CRYP1_IRQHandler,Default_Handler

    .weak      HASH1_IRQHandler
    .thumb_set HASH1_IRQHandler,Default_Handler

    .weak      FPU_IRQHandler
    .thumb_set FPU_IRQHandler,Default_Handler

    .weak      UART7_IRQHandler
    .thumb_set UART7_IRQHandler,Default_Handler

    .weak      UART8_IRQHandler
    .thumb_set UART8_IRQHandler,Default_Handler

    .weak      SPI4_IRQHandler
    .thumb_set SPI4_IRQHandler,Default_Handler

    .weak      SPI5_IRQHandler
    .thumb_set SPI5_IRQHandler,Default_Handler

    .weak      SPI6_IRQHandler
    .thumb_set SPI6_IRQHandler,Default_Handler

    .weak      SAI1_IRQHandler
    .thumb_set SAI1_IRQHandler,Default_Handler

    .weak      LTDC_IRQHandler
    .thumb_set LTDC_IRQHandler,Default_Handler

    .weak      LTDC_ER_IRQHandler
    .thumb_set LTDC_ER_IRQHandler,Default_Handler

    .weak      SAI2_IRQHandler
    .thumb_set SAI2_IRQHandler,Default_Handler

    .weak      QUADSPI_IRQHandler
    .thumb_set QUADSPI_IRQHandler,Default_Handler

    .weak      LPTIM1_IRQHandler
    .thumb_set LPTIM1_IRQHandler,Default_Handler

    .weak      CEC_IRQHandler
    .thumb_set CEC_IRQHandler,Default_Handler

    .weak      I2C4_EV_IRQHandler
    .thumb_set I2C4_EV_IRQHandler,Default_Handler

    .weak      I2C4_ER_IRQHandler
    .thumb_set I2C4_ER_IRQHandler,Default_Handler

    .weak      SPDIF_RX_IRQHandler
    .thumb_set SPDIF_RX_IRQHandler,Default_Handler

    .weak      OTG_IRQHandler
    .thumb_set OTG_IRQHandler,Default_Handler

    .weak      IPCC_RX0_IRQHandler
    .thumb_set IPCC_RX0_IRQHandler,Default_Handler

    .weak      IPCC_TX0_IRQHandler
    .thumb_set IPCC_TX0_IRQHandler,Default_Handler

    .weak      DMAMUX1_OVR_IRQHandler
    .thumb_set DMAMUX1_OVR_IRQHandler,Default_Handler

    .weak      IPCC_RX1_IRQHandler
    .thumb_set IPCC_RX1_IRQHandler,Default_Handler

    .weak      IPCC_TX1_IRQHandler
    .thumb_set IPCC_TX1_IRQHandler,Default_Handler

    .weak      CRYP2_IRQHandler
    .thumb_set CRYP2_IRQHandler,Default_Handler

    .weak      HASH2_IRQHandler
    .thumb_set HASH2_IRQHandler,Default_Handler

    .weak      I2C5_EV_IRQHandler
    .thumb_set I2C5_EV_IRQHandler,Default_Handler

    .weak      I2C5_ER_IRQHandler
    .thumb_set I2C5_ER_IRQHandler,Default_Handler

    .weak      GPU_IRQHandler
    .thumb_set GPU_IRQHandler,Default_Handler

    .weak      DFSDM1_FLT0_IRQHandler
    .thumb_set DFSDM1_FLT0_IRQHandler,Default_Handler

    .weak      DFSDM1_FLT1_IRQHandler
    .thumb_set DFSDM1_FLT1_IRQHandler,Default_Handler

    .weak      DFSDM1_FLT2_IRQHandler
    .thumb_set DFSDM1_FLT2_IRQHandler,Default_Handler

    .weak      DFSDM1_FLT3_IRQHandler
    .thumb_set DFSDM1_FLT3_IRQHandler,Default_Handler

    .weak      SAI3_IRQHandler
    .thumb_set SAI3_IRQHandler,Default_Handler

    .weak      DFSDM1_FLT4_IRQHandler
    .thumb_set DFSDM1_FLT4_IRQHandler,Default_Handler

    .weak      TIM15_IRQHandler
    .thumb_set TIM15_IRQHandler,Default_Handler

    .weak      TIM16_IRQHandler
    .thumb_set TIM16_IRQHandler,Default_Handler

    .weak      TIM17_IRQHandler
    .thumb_set TIM17_IRQHandler,Default_Handler

    .weak      TIM12_IRQHandler
    .thumb_set TIM12_IRQHandler,Default_Handler

    .weak      MDIOS_IRQHandler
    .thumb_set MDIOS_IRQHandler,Default_Handler

    .weak      EXTI14_IRQHandler
    .thumb_set EXTI14_IRQHandler,Default_Handler

    .weak      MDMA_IRQHandler
    .thumb_set MDMA_IRQHandler,Default_Handler

    .weak      DSI_IRQHandler
    .thumb_set DSI_IRQHandler,Default_Handler

    .weak      SDMMC2_IRQHandler
    .thumb_set SDMMC2_IRQHandler,Default_Handler

    .weak      HSEM_IT2_IRQHandler
    .thumb_set HSEM_IT2_IRQHandler,Default_Handler

    .weak      DFSDM1_FLT5_IRQHandler
    .thumb_set DFSDM1_FLT5_IRQHandler,Default_Handler

