JonathanMichaelEdwards/STM32MP157C_SBC/src/Cortex-M4/src/startup_stm32mp157c.s
    .weak      EXTI15_IRQHandler
    .thumb_set EXTI15_IRQHandler,Default_Handler

    .weak      nCTIIRQ1_IRQHandler
    .thumb_set nCTIIRQ1_IRQHandler,Default_Handler

    .weak      nCTIIRQ2_IRQHandler
    .thumb_set nCTIIRQ2_IRQHandler,Default_Handler

    .weak      TIM13_IRQHandler
    .thumb_set TIM13_IRQHandler,Default_Handler

    .weak      TIM14_IRQHandler
    .thumb_set TIM14_IRQHandler,Default_Handler

    .weak      DAC_IRQHandler
    .thumb_set DAC_IRQHandler,Default_Handler

    .weak      RNG1_IRQHandler
    .thumb_set RNG1_IRQHandler,Default_Handler

    .weak      RNG2_IRQHandler
    .thumb_set RNG2_IRQHandler,Default_Handler

    .weak      I2C6_EV_IRQHandler
    .thumb_set I2C6_EV_IRQHandler,Default_Handler

    .weak      I2C6_ER_IRQHandler
    .thumb_set I2C6_ER_IRQHandler,Default_Handler

    .weak      SDMMC3_IRQHandler
    .thumb_set SDMMC3_IRQHandler,Default_Handler

    .weak      LPTIM2_IRQHandler
    .thumb_set LPTIM2_IRQHandler,Default_Handler

    .weak      LPTIM3_IRQHandler
    .thumb_set LPTIM3_IRQHandler,Default_Handler

    .weak      LPTIM4_IRQHandler
    .thumb_set LPTIM4_IRQHandler,Default_Handler

    .weak      LPTIM5_IRQHandler
    .thumb_set LPTIM5_IRQHandler,Default_Handler

    .weak      MPU_SEV_IRQHandler
    .thumb_set MPU_SEV_IRQHandler,Default_Handler

    .weak      RCC_WAKEUP_IRQHandler
    .thumb_set RCC_WAKEUP_IRQHandler,Default_Handler

    .weak      SAI4_IRQHandler
    .thumb_set SAI4_IRQHandler,Default_Handler

    .weak      DTS_IRQHandler
    .thumb_set DTS_IRQHandler,Default_Handler

    .weak      RESERVED148_IRQHandler
    .thumb_set RESERVED148_IRQHandler,Default_Handler

    .weak      WAKEUP_PIN_IRQHandler
    .thumb_set WAKEUP_PIN_IRQHandler,Default_Handler

